modm-ext/data.modm.io/docs/svd/header_stm32l4s7xx.svd
        <register>
          <name>SWPR2</name>
          <description>SYSCFG SRAM2 write protection register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAGE32</name>
              <description>SRAM2 Write protection page 32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE33</name>
              <description>SRAM2 Write protection page 33</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE34</name>
              <description>SRAM2 Write protection page 34</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE35</name>
              <description>SRAM2 Write protection page 35</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE36</name>
              <description>SRAM2 Write protection page 36</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE37</name>
              <description>SRAM2 Write protection page 37</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE38</name>
              <description>SRAM2 Write protection page 38</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE39</name>
              <description>SRAM2 Write protection page 39</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE40</name>
              <description>SRAM2 Write protection page 40</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE41</name>
              <description>SRAM2 Write protection page 41</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE42</name>
              <description>SRAM2 Write protection page 42</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE43</name>
              <description>SRAM2 Write protection page 43</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE44</name>
              <description>SRAM2 Write protection page 44</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE45</name>
              <description>SRAM2 Write protection page 45</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE46</name>
              <description>SRAM2 Write protection page 46</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE47</name>
              <description>SRAM2 Write protection page 47</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE48</name>
              <description>SRAM2 Write protection page 48</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE49</name>
              <description>SRAM2 Write protection page 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE50</name>
              <description>SRAM2 Write protection page 50</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE51</name>
              <description>SRAM2 Write protection page 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE52</name>
              <description>SRAM2 Write protection page 52</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE53</name>
              <description>SRAM2 Write protection page 53</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE54</name>
              <description>SRAM2 Write protection page 54</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE55</name>
              <description>SRAM2 Write protection page 55</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE56</name>
              <description>SRAM2 Write protection page 56</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE57</name>
              <description>SRAM2 Write protection page 57</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE58</name>
              <description>SRAM2 Write protection page 58</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE59</name>
              <description>SRAM2 Write protection page 59</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE60</name>
              <description>SRAM2 Write protection page 60</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE61</name>
              <description>SRAM2 Write protection page 61</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE62</name>
              <description>SRAM2 Write protection page 62</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE63</name>
              <description>SRAM2 Write protection page 63</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
